Documents/ДокПередачаДеталейМенеджеру.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Document>
		<Properties>
			<Name>ДокПередачаДеталейМенеджеру</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВЗапас</xr:Item>
				<xr:Item>InformationRegister.ДвижениеОсновныхДеталей</xr:Item>
				<xr:Item>AccumulationRegister.Используется</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиДеталей</xr:Item>
				<xr:Item>AccumulationRegister.НаСклад</xr:Item>
				<xr:Item>AccumulationRegister.Неисправно</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИсточникПоступленияМенеджеру</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусДетали</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Терминал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Терминалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Менеджеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовыйМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Менеджеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОсновныеДетали</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДетальПередатьМенедж</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РасходныеДеталиВЗапас</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДетальПередатьМенедж</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Комплектующие</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПередатьРасхДет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>25</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ДвижениеОсновныхДеталей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<InformationRegister>
		<Properties>
			<Name>ДвижениеОсновныхДеталей</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусДетали</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Менеджеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СервисТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Терминал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Терминалы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьРемонтаОД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>25</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Менеджеры</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>35</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Деталь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/Используется.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<AccumulationRegister>
		<Properties>
			<Name>Используется</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоРасх</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>25</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИсполнительРасхИсп</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Менеджеры</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийРасхИсп</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДетальРасх</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Комплектующие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТерминалРасх</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Терминалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/НаСклад.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<AccumulationRegister>
		<Properties>
			<Name>НаСклад</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоРасхНаСклад</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>25</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИсполнительРасхНаСклад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Менеджеры</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийРасхНаСклад</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДетальРасхНаСклад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Комплектующие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ВЗапас.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<AccumulationRegister>
		<Properties>
			<Name>ВЗапас</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоРасхЗапас</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>25</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИсполнительРасхЗапас</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Менеджеры</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийРасхЗапас</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДетальРасхЗапас</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Комплектующие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МенеджерРасхЗапас</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Менеджеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/СтатусДетали.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Enum>
		<Properties>
			<Name>СтатусДетали</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаСкладе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВЗапас</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Используется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаРемонте</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неисправно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списано</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ДокПередачаДеталейМенеджеру/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр ДвижениеОсновныхДеталей
	Движения.ДвижениеОсновныхДеталей.Записывать = Истина;
	Для Каждого ТекСтрокаОсновныеДетали Из ОсновныеДетали Цикл
		Движение = Движения.ДвижениеОсновныхДеталей.Добавить();
		Движение.Период = Дата;
		Движение.Деталь = ТекСтрокаОсновныеДетали.ДетальПередатьМенедж;
		Движение.Статус = Перечисления.СтатусДетали.ВЗапас;
		Движение.Менеджер = НовыйМенеджер;
		Движение.Комментарий = Комментарий;
		Если ИсточникПоступленияМенеджеру = Перечисления.СтатусДетали.Используется тогда
			Движение.Исполнитель = НовыйМенеджер;
		ИначеЕсли ИсточникПоступленияМенеджеру = Перечисления.СтатусДетали.ВЗапас тогда
			Движение.Исполнитель = Менеджер;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ИсточникПоступленияМенеджеру = Перечисления.СтатусДетали.Используется тогда
	// регистр Используется Расход
		Движения.Используется.Записывать = Истина;
		Для Каждого ТекСтрокаРасходныеДеталиВЗапас Из РасходныеДеталиВЗапас Цикл
			Движение = Движения.Используется.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.ДетальРасх = ТекСтрокаРасходныеДеталиВЗапас.ДетальПередатьМенедж;
			Движение.ТерминалРасх = Терминал;
			Движение.КоличествоРасх = ТекСтрокаРасходныеДеталиВЗапас.КоличествоПередатьРасхДет;
			Движение.ИсполнительРасхИсп = Менеджер;
			Движение.КомментарийРасхИсп = Комментарий;
		КонецЦикла;
	
	ИначеЕсли ИсточникПоступленияМенеджеру = Перечисления.СтатусДетали.НаСкладе тогда
	// регистр НаСклад Расход
		Движения.НаСклад.Записывать = Истина;
		Для Каждого ТекСтрокаРасходныеДеталиВЗапас Из РасходныеДеталиВЗапас Цикл
			Движение = Движения.НаСклад.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.ДетальРасхНаСклад = ТекСтрокаРасходныеДеталиВЗапас.ДетальПередатьМенедж;
			Движение.КоличествоРасхНаСклад = ТекСтрокаРасходныеДеталиВЗапас.КоличествоПередатьРасхДет;
			Движение.ИсполнительРасхНаСклад = Менеджер;
			Движение.КомментарийРасхНаСклад = Комментарий;
		КонецЦикла;
	КонецЕсли;

	// регистр ВЗапас Приход
	Движения.ВЗапас.Записывать = Истина;
	Для Каждого ТекСтрокаРасходныеДеталиВЗапас Из РасходныеДеталиВЗапас Цикл
		Движение = Движения.ВЗапас.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.ДетальРасхЗапас = ТекСтрокаРасходныеДеталиВЗапас.ДетальПередатьМенедж;
		Движение.МенеджерРасхЗапас = НовыйМенеджер;
		Движение.КоличествоРасхЗапас = ТекСтрокаРасходныеДеталиВЗапас.КоличествоПередатьРасхДет;
		Движение.ИсполнительРасхЗапас = Менеджер;
		Движение.КомментарийРасхЗапас = Комментарий;
	КонецЦикла;


	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
